package com.example.recipes.Interface;

/**
 * @author Артем Нікіфоров
 * @version 1.0
 *
 * Базовий інтерфейс для елементів, які мають ідентифікатор та назву.
 * Використовується як основа для сутностей у додатку, що потребують унікальної ідентифікації
 * та можливості зміни назви.
 */
public interface Item {
    /**
     * Отримує унікальний ідентифікатор елемента.
     * @return Числовий ідентифікатор елемента в БД
     */
    long getId();

    /**
     * Отримує назву елемента.
     * @return Назва елемента
     */
    String getName();

    /**
     * Встановлює нову назву для елемента.
     * @param name Нова назва елемента
     */
    void setName(String name);
}
